{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Oleh Hrechukh&#39;s blog",
	"language": "en",
	"home_page_url": "https://github.com/eleventy-base-blog/olehrechukh/",
	"feed_url": "https://github.com/eleventy-base-blog/feed/feed.json",
	"description": "I am writing about my experiences as a naval navel-gazer.",
	"author": {
		"name": "Oleh Hrechukh",
		"url": "https://olehrechukh.github.io/"
	},
	"items": [
		{
			"id": "https://github.com/eleventy-base-blog/blog/firstpost/",
			"url": "https://github.com/eleventy-base-blog/blog/firstpost/",
			"title": "Number sums solver.",
			"content_html": "<h1 id=\"solving-mobile-game-number-sums-an-algorithmic-approach\" tabindex=\"-1\">Solving Mobile Game Number-Sums: An Algorithmic Approach <a class=\"header-anchor\" href=\"https://github.com/eleventy-base-blog/blog/firstpost/\">#</a></h1>\n<p>Mobile games that involve number-sums puzzles require players to manipulate grid values to match specified row and column sums. This article describes the algorithms implemented to solve such puzzles effectively.</p>\n<h2 id=\"overview-of-gridmodel\" tabindex=\"-1\">Overview of GridModel <a class=\"header-anchor\" href=\"https://github.com/eleventy-base-blog/blog/firstpost/\">#</a></h2>\n<p>The <code>GridModel</code> represents the puzzle grid, including the row and column sums that need to be satisfied. Each cell in the grid can have various states: hidden, solved, or neither. The main goal is to adjust the values in the grid so that the sum of each row and column matches the given targets.</p>\n<h2 id=\"algorithm-descriptions\" tabindex=\"-1\">Algorithm Descriptions <a class=\"header-anchor\" href=\"https://github.com/eleventy-base-blog/blog/firstpost/\">#</a></h2>\n<h3 id=\"1-hiding-higher-values\" tabindex=\"-1\">1. Hiding Higher Values <a class=\"header-anchor\" href=\"https://github.com/eleventy-base-blog/blog/firstpost/\">#</a></h3>\n<p>The first step in solving the puzzle involves hiding values that are higher than their corresponding row or column sums. This is because such values can never contribute to a valid solution. By eliminating these values early on, the complexity of the puzzle is reduced, making subsequent steps more manageable.</p>\n<h3 id=\"2-hiding-redundant-values\" tabindex=\"-1\">2. Hiding Redundant Values <a class=\"header-anchor\" href=\"https://github.com/eleventy-base-blog/blog/firstpost/\">#</a></h3>\n<p>After hiding the higher values, the next step is to hide redundant values in rows and columns. Redundant values are those that cannot possibly contribute to achieving the target sums based on all possible combinations of the remaining values. By removing these redundant values, the search space is further reduced, making it easier to identify the correct values.</p>\n<h3 id=\"3-solving-sum-values\" tabindex=\"-1\">3. Solving Sum Values <a class=\"header-anchor\" href=\"https://github.com/eleventy-base-blog/blog/firstpost/\">#</a></h3>\n<p>Once the higher and redundant values are hidden, the algorithm focuses on solving rows or columns where the sum of the visible values matches the target sums. When the sum of the remaining values in a row or column equals the target, those values are marked as solved. This step ensures that the values contributing to the target sums are identified and fixed, progressing towards the final solution.</p>\n<h3 id=\"4-solving-unique-sum-values\" tabindex=\"-1\">4. Solving Unique Sum Values <a class=\"header-anchor\" href=\"https://github.com/eleventy-base-blog/blog/firstpost/\">#</a></h3>\n<p>The final step involves identifying and solving unique values that satisfy the row or column sums. This step looks for combinations of values that uniquely satisfy the target sums, ensuring that each row and column sum is met precisely. This is done by analyzing all possible combinations of the remaining values and finding those that match the target sums. Unique values that meet the criteria are marked as solved.</p>\n<h2 id=\"algorithm-execution\" tabindex=\"-1\">Algorithm Execution <a class=\"header-anchor\" href=\"https://github.com/eleventy-base-blog/blog/firstpost/\">#</a></h2>\n<p>The algorithms are executed in a loop, applying each step iteratively until the puzzle is solved or no further modifications can be made. This iterative approach ensures that all possible reductions and solutions are explored, leading to the final solution.</p>\n<ol>\n<li><strong>Initialization</strong>: The grid model is initialized with the given values and sums.</li>\n<li><strong>Iteration</strong>: Each algorithm (hiding higher values, hiding redundant values, solving sum values, and solving unique sum values) is applied in sequence.</li>\n<li><strong>Modification Check</strong>: After each algorithm is applied, the grid is checked for modifications. If modifications are made, the process repeats.</li>\n<li><strong>Termination</strong>: The process terminates when the grid is solved (i.e., all row and column sums are zero, and all cells are either hidden or solved) or no further modifications can be made.</li>\n</ol>\n<p>By following these steps, the algorithms systematically reduce the complexity of the puzzle and find the solution efficiently.</p>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://github.com/eleventy-base-blog/blog/firstpost/\">#</a></h2>\n<p>The described algorithms provide a structured approach to solving number-sums puzzles in mobile games. By progressively hiding impossible and redundant values and solving unique sums, the algorithms ensure an efficient and systematic solution. This approach not only simplifies the puzzle-solving process but also enhances the player's experience by providing clear and logical steps towards the solution.</p>\n",
			"date_published": "2024-07-31T00:00:00Z"
		}
		
	]
}
